INSERT into users (`login`, `password`, `role`)
values ('admin',
        'admin',
        0),
       ('moder',
        'moder',
        1),
       ('user',
        'user',
        2);

insert into country (`name`)
values ('USA'),
       ('Great Britain'),
       ('Spain'),
       ('German');

insert into genre (`name`)
values ('Drama'),
       ('Mystery'),
       ('Sci-Fi'),
       ('Crime'),
       ('Horror'),
       ('Thriller'),
       ('Adventure'),
       ('Action'),
       ('Western');

insert into shows (`name`, `rating`, `description`, `logo`, `full_logo`)
values ('Westworld', 8.7, 'В футуристическом парке развлечений «Мир Дикого Запада» специально сконструированные андроиды выполняют любые прихоти посетителей,
чтобы те чувствовали безнаказанность и полную свободу действий.', 'img/wworld.jpg', 'img/ww_full.jpg'),
       ('La Casa de Papel', 8.5,
        'История о преступниках, решивших ограбить Королевский монетный двор Испании и украсть 2,4 млрд евро.',
        'img/papel.jpg', 'img/lcdp_full.jpg'),
       ('Peaky Blinders', 8.8, 'Британский сериал о криминальном мире Бирмингема 20-х годов прошлого века, в котором многолюдная семья Шелби стала одной из самых жестоких и влиятельных гангстерских банд послевоенного времени.
       Фирменным знаком группировки, промышлявшей грабежами и азартными играми, стали зашитые в козырьки лезвия.',
        'img/breb.jpg', 'img/pb_full.jpg'),
       ('See', 7.6, 'В далёком будущем человеческая раса полностью лишилась зрения. Чтобы выжить, людям пришлось найти новый способ сосуществовать, строить и добывать пищу. Всё меняется, когда в семье бесстрашного воина Бабы Восса рождаются зрячие близнецы.
       Их появление рискует нарушить хрупкий баланс нового мира и ввергнуть успокоившуюся цивилизацию в хаос.',
        'img/see.jpg', 'img/see_full.jpg'),
       ('The Mandalorian', 8.8, 'Одинокий мандалорец-наёмник живёт на краю обитаемой галактики, куда не дотягивается закон Новой Республики.
       Представитель некогда могучей расы благородных воинов теперь вынужден влачить жалкое существование среди отбросов общества.',
        'img/mando.jpg', 'img/mando_full.jpg'),
       ('Yellowstone', 8.4, 'Йеллоустон — первый в мире национальный парк, одно из самих посещаемых мест в США. Но здесь, на границе цивилизации, происходит много такого, чего не видят туристы, что не освещается средствами массовой информации. Семья Даттон, главой которой является Джон Даттон, владеет огромным ранчо, сопредельным с территорией парка.
       На их землю претендует и сам парк, и индейская резервация, и жадные застройщики.', 'img/yellow.jpg',
        'img/yellow_full.jpg'),
       ('Dark', 8.7, 'История четырёх семей, живущих спокойной и размеренной жизнью в маленьком немецком городке. Видимая идиллия рушится,
       когда бесследно исчезают двое детей и воскресают тёмные тайны прошлого.', 'img/dark.jpg', 'img/dark_full.jpg');

insert into season (`number_of_season`, `show_id`, `amount_of_episodes`, `release_date`)
values (1, 1, 10, '02.10.16'),
       (2, 1, 10, '22.04.18'),
       (1, 2, 15, '02.05.17'),
       (2, 2, 8, '19.07.19'),
       (1, 3, 6, '12.09.13'),
       (2, 3, 6, '02.10.14'),
       (3, 3, 6, '05.05.16'),
       (4, 3, 6, '15.11.17'),
       (5, 3, 6, '25.08.19'),
       (1, 4, 8, '01.11.19'),
       (1, 5, 8, '12.11.19'),
       (1, 6, 9, '20.06.18'),
       (2, 6, 10, '19.06.19'),
       (1, 7, 10, '01.12.17'),
       (2, 7, 8, '21.06.19');

/*
 WestWorld 1 season
 */

insert into series (`show_id`, `season_id`, `number_of_series`, `rating`, `release_date`)
values (1, 1, 1, 4.6, '02.10.16'),
       (1, 1, 2, 4.66, '09.10.16'),
       (1, 1, 3, 4.63, '16.10.16'),
       (1, 1, 4, 4.72, '23.10.16'),
       (1, 1, 5, 4.32, '30.10.16'),
       (1, 1, 6, 4.45, '06.11.16'),
       (1, 1, 7, 4.42, '13.11.16'),
       (1, 1, 8, 4.86, '20.11.16'),
       (1, 1, 9, 4.16, '27.11.16'),
       (1, 1, 10, 4.28, '04.12.16');

/*
 WestWorld 2 season
 */

insert into series (`show_id`, `season_id`, `number_of_series`, `rating`, `release_date`)
values (1, 2, 1, 4.6, '22.04.18'),
       (1, 2, 2, 4.6, '29.04.18'),
       (1, 2, 3, 4.6, '06.05.18'),
       (1, 2, 4, 4.6, '13.05.18'),
       (1, 2, 5, 4.6, '20.05.18'),
       (1, 2, 6, 4.6, '27.05.18'),
       (1, 2, 7, 4.6, '03.06.18'),
       (1, 2, 8, 4.6, '10.06.18'),
       (1, 2, 9, 4.86, '17.06.18'),
       (1, 2, 10, 4.16, '24.06.18');

/*
 La Casa de Papel 1 season
 */

insert into series (`show_id`, `season_id`, `number_of_series`, `rating`, `release_date`)
values (2, 1, 1, 4.6, '02.05.17'),
       (2, 1, 2, 4.6, '09.05.17'),
       (2, 1, 3, 4.6, '16.05.17'),
       (2, 1, 4, 4.6, '23.05.17'),
       (2, 1, 5, 4.6, '30.05.17'),
       (2, 1, 6, 4.6, '06.06.17'),
       (2, 1, 7, 4.6, '13.06.17'),
       (2, 1, 8, 4.6, '20.06.17'),
       (2, 1, 9, 4.6, '27.06.17'),
       (2, 1, 10, 4.6, '16.10.17'),
       (2, 1, 11, 4.6, '23.10.17'),
       (2, 1, 12, 4.6, '02.11.17'),
       (2, 1, 13, 4.6, '09.11.17'),
       (2, 1, 14, 4.6, '16.11.17'),
       (2, 1, 15, 4.6, '23.11.17');

/*
 La Casa de Papel 2 season
 */

insert into series (`show_id`, `season_id`, `number_of_series`, `rating`, `release_date`)
values (2, 2, 1, 4.34, '19.07.19'),
       (2, 2, 2, 4.76, '19.07.19'),
       (2, 2, 3, 4.12, '19.07.19'),
       (2, 2, 4, 4.65, '19.07.19'),
       (2, 2, 5, 4.27, '19.07.19'),
       (2, 2, 6, 4.78, '19.07.19'),
       (2, 2, 7, 4.69, '19.07.19'),
       (2, 2, 8, 4.86, '19.07.19');

/*
 See 1 season
 */

insert into series (`show_id`, `season_id`, `number_of_series`, `rating`, `release_date`)
values (4, 1, 1, 4.34, '01.11.19'),
       (4, 1, 2, 4.34, '01.11.19'),
       (4, 1, 3, 4.34, '01.11.19'),
       (4, 1, 4, 4.34, '08.11.19'),
       (4, 1, 5, 4.34, '15.11.19'),
       (4, 1, 6, 4.34, '22.11.19'),
       (4, 1, 7, 4.34, '29.11.19'),
       (4, 1, 8, 4.34, '06.12.19');

/*
 The Mandalorian 1 season
 */

insert into series (`show_id`, `season_id`, `number_of_series`, `rating`, `release_date`)
values (5, 1, 1, 4.34, '12.11.19'),
       (5, 1, 2, 4.34, '15.11.19'),
       (5, 1, 3, 4.34, '22.11.19'),
       (5, 1, 4, 4.34, '29.11.19'),
       (5, 1, 5, 4.34, '06.12.19'),
       (5, 1, 6, 4.34, '13.12.19'),
       (5, 1, 7, 4.34, '18.12.19'),
       (5, 1, 8, 4.34, '27.12.19');

/*
 Yellowstone 1 season
 */

insert into series (`show_id`, `season_id`, `number_of_series`, `rating`, `release_date`)
values (6, 1, 1, 4.12, '20.06.18'),
       (6, 1, 2, 4.52, '27.06.18'),
       (6, 1, 3, 4.12, '11.07.18'),
       (6, 1, 4, 4.12, '18.07.18'),
       (6, 1, 5, 4.12, '25.07.18'),
       (6, 1, 6, 4.12, '01.08.18'),
       (6, 1, 7, 4.12, '08.08.18'),
       (6, 1, 8, 4.12, '15.08.18'),
       (6, 1, 9, 4.12, '22.08.18');

/*
 Yellowstone 2 season
 */

insert into series (`show_id`, `season_id`, `number_of_series`, `rating`, `release_date`)
values (6, 2, 1, 4.12, '19.06.19'),
       (6, 2, 2, 4.12, '26.06.19'),
       (6, 2, 3, 4.12, '10.07.19'),
       (6, 2, 4, 4.12, '17.07.19'),
       (6, 2, 5, 4.12, '24.07.19'),
       (6, 2, 6, 4.12, '31.07.19'),
       (6, 2, 7, 4.12, '07.08.19'),
       (6, 2, 8, 4.12, '14.08.19'),
       (6, 2, 9, 4.12, '21.08.19'),
       (6, 2, 10, 4.12, '28.08.19');

/*
 Dark 1 season
 */

insert into series (`show_id`, `season_id`, `number_of_series`, `rating`, `release_date`)
values (7, 1, 1, 4.12, '01.12.17'),
       (7, 1, 2, 4.12, '01.12.17'),
       (7, 1, 3, 4.12, '01.12.17'),
       (7, 1, 4, 4.12, '01.12.17'),
       (7, 1, 5, 4.12, '01.12.17'),
       (7, 1, 6, 4.12, '01.12.17'),
       (7, 1, 7, 4.12, '01.12.17'),
       (7, 1, 8, 4.12, '01.12.17'),
       (7, 1, 9, 4.12, '01.12.17'),
       (7, 1, 10, 4.12, '01.12.17');

/*
 Dark 2 season
 */

insert into series (`show_id`, `season_id`, `number_of_series`, `rating`, `release_date`)
values (7, 2, 1, 4.12, '21.06.19'),
       (7, 2, 2, 4.12, '21.06.19'),
       (7, 2, 3, 4.12, '21.06.19'),
       (7, 2, 4, 4.12, '21.06.19'),
       (7, 2, 5, 4.12, '21.06.19'),
       (7, 2, 6, 4.12, '21.06.19'),
       (7, 2, 7, 4.12, '21.06.19'),
       (7, 2, 8, 4.12, '21.06.19');

insert into viewer (`login`)
values ('user1'),
       ('user2');

insert into wathcing (`viewer_id`, `show_id`)
values (1, 1),
       (1, 3),
       (1, 5),
       (1, 6),
       (2, 4),
       (2, 3),
       (2, 7);

insert into show_country (show_id, country_id)
values (1, 1),
       (2, 3),
       (3, 2),
       (4, 1),
       (5, 1),
       (6, 1),
       (7, 4);

insert into show_genre (show_id, genre_id)
values (1, 1),
       (1, 2),
       (1, 3),
       (2, 2),
       (2, 4),
       (2, 8),
       (3, 1),
       (3, 4),
       (4, 1),
       (4, 3),
       (4, 8),
       (5, 3),
       (5, 7),
       (5, 8),
       (6, 1),
       (6, 9),
       (7, 1),
       (7, 2),
       (7, 4);