package by.training.task3;

public class Exercise4 {
    /*
     С помощью оператора while напишите программу вывода всех четных чисел в диапазоне от 2 до 100
    включительно.
     */
    public static void main(String[] args) {
        int a = 2;
        while (a <= 100) {
            System.out.println(a);
            a += 2;
        }
    }
}
